// src/utils/japanese/godanMap.js

export const godanMap = {
  い: {
    d: "う",
    a: "わ",
    i: "い",
    e: "え",
    o: "お",
    te: "って",
    ta: "った",
  },

  ち: {
    d: "つ",
    a: "た",
    i: "ち",
    e: "て",
    o: "と",
    te: "って",
    ta: "った",
  },

  り: {
    d: "る",
    a: "ら",
    i: "り",
    e: "れ",
    o: "ろ",
    te: "って",
    ta: "った",
  },

  み: {
    d: "む",
    a: "ま",
    i: "み",
    e: "め",
    o: "も",
    te: "んで",
    ta: "んだ",
  },

  び: {
    d: "ぶ",  
    a: "ば",
    i: "び",
    e: "べ",
    o: "ぼ",
    te: "んで",
    ta: "んだ",
  },

  に: {
    d: "ぬ",
    a: "な",
    i: "に",
    e: "ね",
    o: "の",
    te: "んで",
    ta: "んだ",
  },

  き: {
    d: "く",
    a: "か",
    i: "き",
    e: "け",
    o: "こ",
    te: "いて",
    ta: "いた",
  },

  ぎ: {
    d: "ぐ",
    a: "が",
    i: "ぎ",
    e: "げ",
    o: "ご",
    te: "いで",
    ta: "いだ",
  },

  し: {
    d: "す",
    a: "さ",
    i: "し",
    e: "せ",
    o: "そ",
    te: "して",
    ta: "した",
  },
}